package Lesson11;

import java.util.Random; // Импорт случайных значений для разных типов данных

public class Main {
    public static void main(String[] args) {
//        Random rand = new Random(); // Создали новый экземпляр класса.
//
//        int min = 5;
//        int max = 10;
//        int cnt = 30;
//        for (int i = 0; i < cnt; i++) {
////            System.out.println(rand.nextBoolean());
////            System.out.println(rand.nextDouble());
////            System.out.println(rand.nextInt(max)); // от 0 до 10 не включая 10.
////            System.out.println(rand.nextInt(max - min) + min); // от 5 до 10 не включая 10
//            System.out.println(rand.nextInt(max - min + 1) + min); // от 5 до 10 квлючая 10
//        }// Продолжить 07.02.24 -2- 0.51 (Задача)
        // Для новой задачи создаем новый пакет.

        // Задача. Создать массив из 10 элементов. Поля ФИО, номер группы, успеваемость. Предусаотреть ввод ФИО и группу. Оценить от 7 до 12 баллов включительно.

    }
}
